samples/retrieve_single_send_triggered_send.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <SOAP-ENV:Header>
  <wsse:Security
   xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
     xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
   <wsu:Timestamp>
    <wsu:Created>2011-02-10T22:50:19Z</wsu:Created>
    <wsu:Expires>2011-02-10T22:55:19Z</wsu:Expires>
   </wsu:Timestamp>
   <wsse:UsernameToken>
    <wsse:Username>*********</wsse:Username>
    <wsse:Password
   Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">*********</wsse:Password>
    <wsse:Nonce>Z0t8GwPaePcnL/jGCAaqgij9Bds=</wsse:Nonce>
    <wsu:Created>2011-02-10T22:50:19Z</wsu:Created>
   </wsse:UsernameToken>
  </wsse:Security>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
  <RetrieveRequestMsg xmlns="http://exacttarget.com/wsdl/partnerAPI">
   <RetrieveRequest>
    <ObjectType>SMSTriggeredSendDefinition</ObjectType>
    <Properties>ObjectID</Properties>
    <Properties>CustomerKey</Properties>
    <Properties>Client.ID</Properties>
    <Properties>Name</Properties>
    <Properties>Description</Properties>
    <Properties>Publication.ID</Properties>
    <Properties>CreatedDate</Properties>
    <Properties>CreatedBy</Properties>
    <Properties>ModifiedDate</Properties>
    <Properties>ModifiedBy</Properties>
    <Properties>Content.ID</Properties>
   </RetrieveRequest>
  </RetrieveRequestMsg>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
